In [2]:
%load_ext sql

In [6]:
%sql mysql+pymysql://root:localhost:3306/dannys_diner

'Connected: root@dannys_diner'

In [3]:
%%sql
SELECT *
FROM
    dannys_diner.sales;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
15 rows affected.

[('A', datetime.date(2021, 1, 1), 1),
 ('A', datetime.date(2021, 1, 1), 2),
 ('A', datetime.date(2021, 1, 7), 2),
 ('A', datetime.date(2021, 1, 10), 3),
 ('A', datetime.date(2021, 1, 11), 3),
 ('A', datetime.date(2021, 1, 11), 3),
 ('B', datetime.date(2021, 1, 1), 2),
 ('B', datetime.date(2021, 1, 2), 2),
 ('B', datetime.date(2021, 1, 4), 1),
 ('B', datetime.date(2021, 1, 11), 1),
 ('B', datetime.date(2021, 1, 16), 3),
 ('B', datetime.date(2021, 2, 1), 3),
 ('C', datetime.date(2021, 1, 1), 3),
 ('C', datetime.date(2021, 1, 1), 3),
 ('C', datetime.date(2021, 1, 7), 3)]

# Question 1 - What is the total amount each customer spent at the restaurant?

In [4]:
%%sql
SELECT
    customer_id,
    SUM(price) AS Amount_spent
FROM
    sales
INNER JOIN
    menu
ON sales.product_id = menu.product_id
GROUP BY
    customer_id;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', Decimal('76')), ('B', Decimal('74')), ('C', Decimal('36'))]

# Question 2 - How many days has each customer visited the restaurant?

In [5]:
%%sql
SELECT
    customer_id,
    COUNT(DISTINCT order_date) AS Days_visited
FROM
    sales
GROUP BY
    customer_id;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', 4), ('B', 6), ('C', 2)]

# Question 3 - What was the first item from the menu purchased by each customer?

In [6]:
%%sql
SELECT
    customer_id,
    product_name
FROM
    (SELECT
        customer_id, product_id, order_date,
        ROW_NUMBER() OVER(PARTITION BY customer_id ORDER BY order_date ASC) AS rnk
    FROM
        sales) e
JOIN
    menu
ON
    e.product_id = menu.product_id
WHERE e.rnk = 1

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('A', 'sushi'), ('B', 'curry'), ('C', 'ramen')]

In [17]:
%%sql

SELECT
        customer_id, product_id, order_date,
        ROW_NUMBER() OVER(PARTITION BY customer_id ORDER BY order_date ASC) AS rnk
    FROM
        sales

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
15 rows affected.

[('A', 1, datetime.date(2021, 1, 1), 1),
 ('A', 2, datetime.date(2021, 1, 1), 2),
 ('A', 2, datetime.date(2021, 1, 7), 3),
 ('A', 3, datetime.date(2021, 1, 10), 4),
 ('A', 3, datetime.date(2021, 1, 11), 5),
 ('A', 3, datetime.date(2021, 1, 11), 6),
 ('B', 2, datetime.date(2021, 1, 1), 1),
 ('B', 2, datetime.date(2021, 1, 2), 2),
 ('B', 1, datetime.date(2021, 1, 4), 3),
 ('B', 1, datetime.date(2021, 1, 11), 4),
 ('B', 3, datetime.date(2021, 1, 16), 5),
 ('B', 3, datetime.date(2021, 2, 1), 6),
 ('C', 3, datetime.date(2021, 1, 1), 1),
 ('C', 3, datetime.date(2021, 1, 1), 2),
 ('C', 3, datetime.date(2021, 1, 7), 3)]

# Question 4 - What is the most purchased item on the menu and how many times was it purchased by all customers?

In [7]:
%%sql

SELECT
    product_name,
    MAX(number_of_times_product) AS number_of_times_purchased
FROM
    (SELECT
        *,
        COUNT(product_id) OVER(PARTITION BY Product_id)  AS number_of_times_product
    FROM
        sales) e
JOIN
    menu
ON
    e.product_id = menu.product_id
GROUP BY
    product_name
ORDER BY 
    number_of_times_purchased DESC

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
3 rows affected.

[('ramen', 8), ('curry', 4), ('sushi', 3)]

In [9]:
%%sql

SELECT
    product_name AS most_purchased_product,
    count(e.product_id) AS number_of_times_purchased
FROM
    sales e
JOIN
    menu
ON
    e.product_id = menu.product_id
GROUP BY
    product_name
ORDER BY 
    number_of_times_purchased DESC
LIMIT 1

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
1 rows affected.

[('ramen', 8)]

# Question 5 - Which item was the most popular for each customer?

In [10]:
%%sql

WITH Ranked_Products AS (
    SELECT
        customer_id,
        product_name,
        COUNT(*) AS purchase_count,
        RANK() OVER (PARTITION BY s.customer_id ORDER BY COUNT(*) DESC) lINE 
    FROM
        Sales s
    JOIN
        menu  ON s.product_id = menu.product_id
    GROUP BY
        s.customer_id, menu.product_name
)
SELECT
    customer_id,
    product_name
FROM
    Ranked_Products
WHERE
    lINE = 1;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
5 rows affected.

[('A', 'ramen'),
 ('B', 'curry'),
 ('B', 'sushi'),
 ('B', 'ramen'),
 ('C', 'ramen')]

# Question 6 - Which item was purchased first by the customer after they became a member?

In [11]:
%%sql

SELECT
    customer_id,
    product_name
FROM
    (SELECT
        s.customer_id,
        m.product_name,
        s.order_date,
        FIRST_VALUE(s.product_id) OVER(PARTITION BY s.Order_date ORDER BY s.order_date),
        ROW_NUMBER() OVER(PARTITION BY s.customer_id) AS rnum
    FROM sales s
    LEFT JOIN members mb
    ON s.customer_id = mb.customer_id
    LEFT JOIN
        menu m
    ON s.product_id = m.product_id
    WHERE mb.join_date < s.order_date) e

WHERE rnum = 1;

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
2 rows affected.

[('A', 'ramen'), ('B', 'sushi')]

# Question 7 - Which item was purchased just before the customer became a member?

In [12]:
%%sql

SELECT
    customer_id,
    product_name
FROM
    (SELECT
        s.customer_id,
        m.product_name,
        s.order_date,
        FIRST_VALUE(s.product_id) OVER(PARTITION BY s.Order_date ORDER BY s.order_date),
        ROW_NUMBER() OVER(PARTITION BY s.customer_id) AS rnum
    FROM sales s
    LEFT JOIN members mb
    ON s.customer_id = mb.customer_id
    JOIN
        menu m
    ON s.product_id = m.product_id
    WHERE mb.join_date > s.order_date) e

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
5 rows affected.

[('A', 'sushi'),
 ('A', 'curry'),
 ('B', 'curry'),
 ('B', 'curry'),
 ('B', 'sushi')]

# Question 8 - What is the total items and amount spent for each member before they became a member?

In [13]:
%%sql

SELECT
    s.customer_id,
    COUNT(s.product_id) AS total_item,
    SUM(price) AS total_amount
FROM
    sales s
JOIN
    menu m

ON 
    s.product_id = m.product_id
LEFT JOIN
    members mb
ON
    s.customer_id = mb.customer_id

WHERE
    join_date > order_date
GROUP BY
    customer_id

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
2 rows affected.

[('A', 2, Decimal('25')), ('B', 3, Decimal('40'))]

# Question 9 - If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

In [8]:
%%sql

SELECT
    customer_id,
    CASE
    WHEN product_id = "sushi"
    THEN 2 * SUM(price) 
    AS total_amount
FROM
    sales s
JOIN
    menu m

ON 
    s.product_id = m.product_id
GROUP BY
    customer_id

 * mysql+pymysql://root:***@localhost:3306/dannys_diner
(pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'AS total_amount\nFROM\n    sales s\nJOIN\n    menu m\n\nON \n    s.product_id = m.produ' at line 6")
[SQL: SELECT
    customer_id,
    CASE
    WHEN product_id = "sushi"
    THEN 2 * SUM(price)
    AS total_amount
FROM
    sales s
JOIN
    menu m

ON
    s.product_id = m.product_id
GROUP BY
    customer_id]
(Background on this error at: http://sqlalche.me/e/14/f405)

# Question 10 - In the first week after a customer joins the program (including their join date) they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?